// 18991 实验1.2 调和级数求和
// Description
// 求调和级数前k项之和（1+1/2+1/3+...+1/k），输入整数k>0，输出两种调和级数前k项和，
// 前一种是从左到右求和；后一种是从右到左求和（使用双精度double类型精确到小数点后14位）。
// 输入格式
// 实验输入数据格式
// m(整数，实验数据总数)
// k1(整数，调和级数项数)
// k2(整数，调和级数项数)
// ...
// km(整数，调和级数项数)
// 输出格式
// 实验输出数据格式
// x1(实数，k1项调和级数从左到右求和)  y1(实数，k1项调和级数从右到左求和) 
// x2(实数，k2项调和级数从左到右求和)  y2(实数，k2项调和级数从右到左求和)
// ...
// xm(实数，km项调和级数从左到右求和)  ym(实数，km项调和级数从右到左求和)
// 输入样例
// 3
// 10
// 100
// 1000
// 输出样例
// 2.92896825396825 2.92896825396825
// 5.18737751763962 5.18737751763962
// 7.48547086055034 7.48547086055034

#include <iostream>

using namespace std;

int main()
{
    int m;
    cin >> m;
    int k[m];
    for (int i = 0; i < m; i++)
    {
        cin >> k[i];
    }
    for (int i = 0; i < m; i++)
    {
        double sum1 = 0.0, sum2 = 0.0;
        for (int j = 1; j <= k[i]; j++)
        {
            sum1 += 1.0 / j;
        }
        for (int j = k[i]; j >= 1; j--)
        {
            sum2 += 1.0 / j;
        }
        printf("%.14lf %.14lf\n", sum1, sum2);
    }
    return 0;
}